---
kind: method
id: M:Autodesk.Revit.DB.ModelCurve.ChangeToReferenceLine
source: html/6854c738-eba1-4dd2-0983-6e3ef7324720.htm
---
# Autodesk.Revit.DB.ModelCurve.ChangeToReferenceLine Method

Changes this curve to a reference curve.

## Syntax (C#)
```csharp
public void ChangeToReferenceLine()
```